ir_version: 6
producer_name: "pytorch"
producer_version: "1.9"
graph {
  node {
    input: "0"
    output: "24"
    name: "Shape_0"
    op_type: "Shape"
  }
  node {
    input: "24"
    input: "25"
    output: "26"
    name: "Gather_2"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "26"
    output: "28"
    name: "Unsqueeze_3"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "28"
    input: "71"
    output: "30"
    name: "Concat_4"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "0"
    input: "30"
    output: "31"
    name: "Reshape_5"
    op_type: "Reshape"
  }
  node {
    input: "31"
    input: "32"
    output: "33"
    name: "Mul_7"
    op_type: "Mul"
  }
  node {
    input: "33"
    input: "34"
    output: "35"
    name: "Sub_9"
    op_type: "Sub"
  }
  node {
    input: "35"
    input: "36"
    output: "37"
    name: "MultiThreshold_11"
    op_type: "MultiThreshold"
    attribute {
      name: "out_bias"
      f: -1.0
      type: FLOAT
    }
    attribute {
      name: "out_dtype"
      s: "BIPOLAR"
      type: STRING
    }
    attribute {
      name: "out_scale"
      f: 2.0
      type: FLOAT
    }
    domain: "finn.custom_op.general"
  }
  node {
    input: "37"
    input: "38"
    output: "39"
    name: "MatMul_13"
    op_type: "MatMul"
  }
  node {
    input: "39"
    input: "40"
    output: "41"
    name: "Mul_15"
    op_type: "Mul"
  }
  node {
    input: "41"
    input: "features.3.weight"
    input: "features.3.bias"
    input: "features.3.running_mean"
    input: "features.3.running_var"
    output: "42"
    name: "BatchNormalization_16"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "42"
    input: "43"
    output: "44"
    name: "MultiThreshold_18"
    op_type: "MultiThreshold"
    attribute {
      name: "out_bias"
      f: -1.0
      type: FLOAT
    }
    attribute {
      name: "out_dtype"
      s: "BIPOLAR"
      type: STRING
    }
    attribute {
      name: "out_scale"
      f: 2.0
      type: FLOAT
    }
    domain: "finn.custom_op.general"
  }
  node {
    input: "44"
    input: "45"
    output: "46"
    name: "MatMul_20"
    op_type: "MatMul"
  }
  node {
    input: "46"
    input: "47"
    output: "48"
    name: "Mul_22"
    op_type: "Mul"
  }
  node {
    input: "48"
    input: "features.7.weight"
    input: "features.7.bias"
    input: "features.7.running_mean"
    input: "features.7.running_var"
    output: "49"
    name: "BatchNormalization_23"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "49"
    input: "50"
    output: "51"
    name: "MultiThreshold_25"
    op_type: "MultiThreshold"
    attribute {
      name: "out_bias"
      f: -1.0
      type: FLOAT
    }
    attribute {
      name: "out_dtype"
      s: "BIPOLAR"
      type: STRING
    }
    attribute {
      name: "out_scale"
      f: 2.0
      type: FLOAT
    }
    domain: "finn.custom_op.general"
  }
  node {
    input: "51"
    input: "52"
    output: "53"
    name: "MatMul_27"
    op_type: "MatMul"
  }
  node {
    input: "53"
    input: "54"
    output: "55"
    name: "Mul_29"
    op_type: "Mul"
  }
  node {
    input: "55"
    input: "features.11.weight"
    input: "features.11.bias"
    input: "features.11.running_mean"
    input: "features.11.running_var"
    output: "56"
    name: "BatchNormalization_30"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "56"
    input: "57"
    output: "58"
    name: "MultiThreshold_32"
    op_type: "MultiThreshold"
    attribute {
      name: "out_bias"
      f: -1.0
      type: FLOAT
    }
    attribute {
      name: "out_dtype"
      s: "BIPOLAR"
      type: STRING
    }
    attribute {
      name: "out_scale"
      f: 2.0
      type: FLOAT
    }
    domain: "finn.custom_op.general"
  }
  node {
    input: "58"
    input: "59"
    output: "60"
    name: "MatMul_34"
    op_type: "MatMul"
  }
  node {
    input: "60"
    input: "61"
    output: "62"
    name: "Mul_36"
    op_type: "Mul"
  }
  node {
    input: "62"
    input: "features.15.running_mean"
    output: "63"
    name: "Sub_37"
    op_type: "Sub"
  }
  node {
    input: "72"
    input: "66"
    output: "67"
    name: "Pow_39"
    op_type: "Pow"
  }
  node {
    input: "63"
    input: "67"
    output: "68"
    name: "Div_40"
    op_type: "Div"
  }
  node {
    input: "68"
    input: "features.15.weight"
    output: "69"
    name: "Mul_41"
    op_type: "Mul"
  }
  node {
    input: "69"
    input: "features.15.bias"
    output: "70"
    name: "Add_42"
    op_type: "Add"
  }
  name: "torch-jit-export"
  initializer {
    dims: 64
    data_type: 1
    name: "features.3.weight"
    raw_data: "\360h\233?\001\262\314?\203V\247?\334<\247?\360F\344?\235Z\260?\357K\312?S\307\212? x\213?\316\331g?\245\376a?\347Ip?\301\204\327?\261\322\250?O|\273?\003\250\353?\226kp?\235:P?\265q\266?\324uY?x\346v?\207#\202=\036X\242?\252\344\215?\277\017\320?\370\322\316?@\346\377?[\375\324?{\315a?\"\013\224?d\344\211?Ge\312?\327E\035?\232\374\241?\245\346\217?\324Um?u\020\204?\337[\\?d\330\231?\240\322\300?\333\307\342?\200\210\257?\201O\240?{\374\276?\311X\177?\246\n\230?\207\032\217?\031\361\251?\037\363\001@\263\304P\274\324\374\203?Z\003\214?\223\344\222?\355v\277?\331\206{?\353|p?\223\207l?\n%\230?u&n?\010\253\303?\217\304\254?\266\355\212?G\305\214?\006\260l?"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "features.3.bias"
    raw_data: "\344D\231<\253?\023>y\"a>B\326p?\353\213\023?Fj\023=\256\376\350>\251\337\307\276\026G&>c\022\201\275\267\274!\276\256@7=\363Pz\276s\2608>\"\310\003?\247\027\001?M\200J>\257\343\200<yVM\277*[\257>\2405\331\276\036\345\337<*-\262=\335q\242\275\332*E?I\000\242>\212\320\375\276\032\263>\277\267~\326=m\336-=Z\305\356<O%;?\273\331\212\276\247k\244>#\373p>\371\305\345\276)l\177\275\371t\'\276i=<\275\250o\345\276-\233J\277J\210\347\275\020!\213>\255]\221\276\n\020\216=9\352\001\277\215\200Z\277\004\276#\276\376\347K?13\333=\222\013h>]\371\020>y*;\276+\254\245\276g6\024\277\264\'\r\277\'\212\260\274\262\202\022\276N\225\003?\346\010\005\277\300s\253\276\2628Q<\023\222u>r6\240="
  }
  initializer {
    dims: 64
    data_type: 1
    name: "features.3.running_mean"
    raw_data: "\310\266\310A\021a\330>(\342\221\302\2241h\302\227\026L@\210\255<\302\352\216\203A\224n\"B\356\300I\302\340\243ABp2y\301\304\251 \301\036\023$A\351\302\231\301\034\370\232\302\336R\230\302\256Y:\302\021\222\004BDE\203A\2106\361\300\314\273hB\351\'\272A\373\345\031B\221r<\277%9\'\302\312\243\242\301\320\210\211A\334\252\020B\274\270\271@4\223\263A\376\377~A\372\003Q\302\257\005\212\301B\264\313\301\340\265L\302\326?\002B\236\302\213@\'!\231@\tpkA\320\334\rB\"\211\213A>%>A\032\322\207\302\353\275\345@\035\374\026\301nV\200B\313\177$\301\201\335\330\301Cl\333A\316e-@\032\355P\301\316=\036\302z\260\023\301y-\250\301\310\332V@\216\362$\301\330\370\205\300\217\277\271Aw\020\362A\243\326\246\301L>\234A\214|b\302\246\264\363\277~EN\301"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "features.3.running_var"
    raw_data: "\211O\210DT\302\235D0\235\301D\361\245\240D\265\255\356D@\202\220D\215<\265D\331\014\315D|\"\244D23\213D\2709\226DC6\234D\243v\330D\352m\247D\355\356\267D+\036\036E\261A\251D\257Y\260D\330\226\335D\272q\235Dn\355\301D\302\353>D\033\025\236D\334\013\246D$e\337DB\230\350DNK\346D\310\272\330Dl5\306D\242\355\223D\366\351ODB\006\322D\303\241\227D\247\231`D\322\004\235D\270\002\337D$\210\202Dr\271\227DH\214\305D\027\305\306D\373\204\001E\230\304\266D\0300\311Da\021\325D[\236\215D~\246\211D\351}\266D\2147\221D&\307\331D\000f\024DO\240\200D\323\\\235D\243M\236D\201\357\365D\td\276D?\372\217Df\005\217D\363\326\310D\212\324\202D\177B\304Djb\275D\314\210\243D\211\302\253D\217H\263D"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "features.7.weight"
    raw_data: "\332j\263?G\322+?_i\250?JQ\251?Tu\211??p\227?.\023\334?^\324\277?\212O\326?\300\252\247?\020\200\021?\270\271\221?\300j\250?\336n3?\220\355\322?|\276\272?>o|?\014\212\277?U \357?\3444\016?\232\302\254?Xn\000?\225<~?\302J:?\017\303\202?\033\247\306?%\224\251?\014\240\222?\251\304\260?f\227\204?\332pa?\266-\332?\272v\351?\270\315\317?\305\337U?\307(\271?\223\322W?WJ\315?\374\013\347?\272\344\215?B\277\223?|\357\177?\214\276X?\200\026\224?n\035\213?\025\013\253?\3426\257>C\232K?\\\344\207?\225/p?\340\346}?\355\376h?\256?p?m\013\214?\272\324\231?\215\360\217?\254\'\232?\246\207~?H\371\227?\024E\325?\232G\256?\3753\202?\372\342\266?\234\354\240?"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "features.7.bias"
    raw_data: "\241S\026\277a<\254=\260\023\303\277\320>\"<\232\004\231>\\\351\246?\nLn\276v\241\327\276\"\256\036?2*\312\277\226!\315=\334UI>|#\344\275\363\2464\275\230\021Z?\365{\352\277\373+h\275\227\342q\276\324\343\203>-L}=\263\311\305=\203w\225\275Y\341\030?QD\024\276#\245z\275V\013\370\276,\224\276\276(+\247\276\272{\203\276:\230\001;{\033o\276\210\r\311>\254\216\346>\335M\265>\203#\n\275N\332\337<\2050\305>\332!\237\276\353\320\236\2769\375\236\275\307z\000>\361\210\267\276\356\232\005\277d\202\247\276\364Dh>n8B\276\262\370`;q@\336=\016\331\026<\271\330\331>\257O\262\276\2026\311>\340A\270\276\344\337_\276\264\037J?\036\214\214>\\[\267>V\237@>S$9\277w\254\020?\321\251\334\276\213\207\334\276\212\027^?`\273\213?"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "features.7.running_mean"
    raw_data: "Q\252\245?\365\257\342?\301-\257\277\370\3647\2776U\257?{\3077@\t\005N?~\023\346\276\356\247\261?S\262)\277\034c\305>\300F4@hM*?\242\376\241@\336 S@\276\325I?C+\240?3\300\014\277\202\201\351\277\321~\377\275\261\353\272\277h\364)@\373\203\216\300\033\2613>p\006h\300\004G&\300u \r?\357D\365\277\351=\226=\0044\246\277\033\"\236?\330\241\336>X\027\017\300\261\360\024@\206\014\251\277\224\220q@4\324#\276\267\300\031@\n@\241@\344n}\300.\016\260?\252\306\246@T\003-@\004 C?\334\026\204\276\364g,\277\265\"\207\277J\342\030\300\210\231\213\300u\366\230\277\275\001\262?S\316\255\300\023\211\374?\315\312\305\276\253E\036\300\016\376x\277\376\025\240\277O\326\023@\363\317\232\276\225\203\221?25\320=\214q9\277\270o\342>\"\350M\277"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "features.7.running_var"
    raw_data: "f\274rC\005\361\360B\353\\oC\332\302CCB\026lCP\241\201C\375\353KC\032\026\200C\332\335RCem[C\021\267\022CK\210GCb\315_C\247\366`C9\344eC,Q~C3\001*C\305\212\177C\024\025tC?\177\017C\374\316~C\246\323\373B\364\260\363B\255\r\375B\302@cC|:\226C\273\317,C\366\0335C\315\214cC\343kcCV\'\007C)>\202C\316EYC,\245eC\263m\343B\216\266\\C|\221\022C\262\363:C\270>\201C\342*2C$\266$Cx\306\031C\311=,C\311\372\014C[v5C\277\211\020C\250&\007C\211\021\024C#\006;C\366\204%Cm 9C\312.&C\024\017>C\344\312\037CQ`:CVX C\326\224bC\324Y\016Cd`)Ci\r^C\2357NC\353\305\032C\375lSCT\353AC"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "features.11.weight"
    raw_data: "\357\360\203?j\025y\2745\352\362?\232\317\235?\207X\330?\001\371\316?\003\273\315?\331\260\025<)\237\237?\336\010\302?\227\000\365?Z$\265?O:\201?\347%\300?\031\207\365\274\020\262\300;\016\034\305?jY\242?\004\200\000@\"<\202?\020\247\004@\344\217\335?`\n\276?\014\230\315?\265\342\307?\376\272\360?\364\220\002@\007T\262?\211K\246?\255\003\305?\253\004\307?\312\275\227?\013\201\251?\207\022p>rB\360?\271z\233?\016\246\262?k\230\245?*\327\316?\323\333\310?\310\003\231?|g\207?\315\274\250?\333\311\206?/\005\317?R\234y?2F\227?[f\323?+p ?`y\252?\036\t\261?\214\203\267?\232\240\315?D9\237?\004\217\345\274\031I\026=\266E\272?:^\225?\254\374\272?\221\277\237?\\W\312?S\334\264?=&Q?\262\372e?"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "features.11.bias"
    raw_data: "\265\010\233\275\002\242\240<\232\314\256>\326_#\276\0305*>\331\345\241\276b\211\016\276Xo\210\273\270\273\312=\341#\313\276w\241\346=\223# ?T\232\376=\350\324\325>\261\322\276<&#\232\273\255\363\016=;i\325\275\347\335-\276\366\304\326>\252&\375=\326\353\203\276\340\232%?\246\007\231=m\350%>\027d\031=d4\360\275\373:\021>b\273.\2765ob?u\265g\276_\212\344\276\2140N=3h\206=\r/\316\2765\351\201\274\033\213\204\276\026\n\210>\375_\025?|\335Y\275\222\365\310;\223\227\324=%P\276\275\231\027\316<a\246\026\277\001\277\336=~\254\300=\001\033Y\274\333\3046=\265n\352=\255\372\333\275\356\032|\276>\343\342>\277<o>\245\320\374;Vt\270\274\314\037\234\276:<\216\276$\200\373=\270\353\233\275%\010\216\276\217\027c\276s\274*=\3345\005\275"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "features.11.running_mean"
    raw_data: "\301f\256?\203\3549?\240\256\303\277I\316\262?\224D\224?\343.\273>\326-\276?\331\265\016@\020\301\r\300f\323e\277X&\010@\024J\200\276\376\354\271\277D\265\337?\236\013.@n+\241@\204\237\005@\036B\032\300\200\307<@\032\014J\300\347g\255?\250\364\010@\274\361\365\275\357\342f\300\265\320\302\277NA\273?\323\215\274\277\276\022\r@\322\203W@\261\013\322\277]\351I?\330\002-\277\002\351\270\277L\274\352>\026\t\026@X\277N\277;\331\016\276*\201\202?[2\275>,X\270\275\342\001\317?\3751\017\300\206\226\225>p\230,\277\327\240 \276\376}\204\276C\240 ?\336\213\003\276\331S\222?\327\021\213\277\370\215N\277\204\r\013\277\266S\204?qMA\277\332\225A\276\024gD@Fi\246?\376\242\007\300\036\370\261\273n\325\037?7\203/>\270?\371?d\242\336?2\207\263\275"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "features.11.running_var"
    raw_data: "!-\200Cx\246\337B\273SuC\365CTC.yAC\314tnC\275\037IC\235L\266B\273.JC;n\\C\363\243:C\326ogC\277\352\373B\352\350<C\334\350\356BQ\324\260BO\217EC\020\370MC2\211^C~T\031CR\321\215C\376\277YC\324ZOC\020\305mC+9gC\326O\236C0#\232C\220\363RC\002\307oC6X\210C\223\367\202C\300\265\024C\372\315?C\373\275\331BA\325\177C\346\301#Cl\305FChRECv|\\Cb\253[C0\254\035C\03513C\241vOC\356\241VC\362\366\020C\366\177\005Cy\302\020C\347\346UC\320\254\031C[\3409CLsgC\212\206\026C5+\207C\267&\362B\274\347\333Ba\010\216B\347e<C\216[LC\265n/C\347\243UC%\365vC\343\247EC38/C\257Q\344B"
  }
  initializer {
    dims: 1
    data_type: 1
    name: "features.15.weight"
    raw_data: "J\024??"
  }
  initializer {
    dims: 1
    data_type: 1
    name: "features.15.bias"
    raw_data: ">\027\227\277"
  }
  initializer {
    dims: 1
    data_type: 1
    name: "features.15.running_mean"
    raw_data: "\260rX?"
  }
  initializer {
    dims: 1
    data_type: 7
    name: "71"
    raw_data: "\377\377\377\377\377\377\377\377"
  }
  initializer {
    dims: 1
    data_type: 1
    name: "72"
    raw_data: "\375\253\222C"
  }
  initializer {
    data_type: 7
    name: "25"
    raw_data: "\000\000\000\000\000\000\000\000"
  }
  initializer {
    data_type: 1
    name: "32"
    raw_data: "\000\000\000@"
  }
  initializer {
    dims: 1
    data_type: 1
    name: "34"
    raw_data: "\000\000\200?"
  }
  initializer {
    dims: 1
    dims: 1
    data_type: 1
    name: "36"
    raw_data: "\000\000\000\000"
  }
  initializer {
    dims: 784
    dims: 64
    data_type: 1
    name: "38"
    raw_data: 