FC(
  (features): ModuleList(
    (0): QuantIdentity(
      (input_quant): ActQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
      )
      (act_quant): ActQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
        (fused_activation_quant_proxy): FusedActivationQuantProxy(
          (activation_impl): Identity()
          (tensor_quant): ClampedBinaryQuant(
            (scaling_impl): ConstScaling(
              (restrict_clamp_scaling): _RestrictClampValue(
                (clamp_min_ste): Identity()
                (restrict_value_impl): FloatRestrictValue()
              )
              (value): StatelessBuffer()
            )
            (bit_width): BitWidthConst(
              (bit_width): StatelessBuffer()
            )
            (zero_point): StatelessBuffer()
            (delay_wrapper): DelayWrapper(
              (delay_impl): _NoDelay()
            )
            (tensor_clamp_impl): TensorClamp()
          )
        )
      )
    )
    (1): Dropout(p=0.2, inplace=False)
    (2): QuantLinear(
      in_features=784, out_features=64, bias=False
      (input_quant): ActQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
      )
      (output_quant): ActQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
      )
      (weight_quant): WeightQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
        (tensor_quant): BinaryQuant(
          (scaling_impl): ConstScaling(
            (restrict_clamp_scaling): _RestrictClampValue(
              (clamp_min_ste): Identity()
              (restrict_value_impl): FloatRestrictValue()
            )
            (value): StatelessBuffer()
          )
          (bit_width): BitWidthConst(
            (bit_width): StatelessBuffer()
          )
          (zero_point): StatelessBuffer()
          (delay_wrapper): DelayWrapper(
            (delay_impl): _NoDelay()
          )
        )
      )
      (bias_quant): BiasQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
      )
    )
    (3): BatchNorm1d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (4): QuantIdentity(
      (input_quant): ActQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
      )
      (act_quant): ActQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
        (fused_activation_quant_proxy): FusedActivationQuantProxy(
          (activation_impl): Identity()
          (tensor_quant): ClampedBinaryQuant(
            (scaling_impl): ConstScaling(
              (restrict_clamp_scaling): _RestrictClampValue(
                (clamp_min_ste): Identity()
                (restrict_value_impl): FloatRestrictValue()
              )
              (value): StatelessBuffer()
            )
            (bit_width): BitWidthConst(
              (bit_width): StatelessBuffer()
            )
            (zero_point): StatelessBuffer()
            (delay_wrapper): DelayWrapper(
              (delay_impl): _NoDelay()
            )
            (tensor_clamp_impl): TensorClamp()
          )
        )
      )
    )
    (5): Dropout(p=0.2, inplace=False)
    (6): QuantLinear(
      in_features=64, out_features=64, bias=False
      (input_quant): ActQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
      )
      (output_quant): ActQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
      )
      (weight_quant): WeightQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
        (tensor_quant): BinaryQuant(
          (scaling_impl): ConstScaling(
            (restrict_clamp_scaling): _RestrictClampValue(
              (clamp_min_ste): Identity()
              (restrict_value_impl): FloatRestrictValue()
            )
            (value): StatelessBuffer()
          )
          (bit_width): BitWidthConst(
            (bit_width): StatelessBuffer()
          )
          (zero_point): StatelessBuffer()
          (delay_wrapper): DelayWrapper(
            (delay_impl): _NoDelay()
          )
        )
      )
      (bias_quant): BiasQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
      )
    )
    (7): BatchNorm1d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (8): QuantIdentity(
      (input_quant): ActQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
      )
      (act_quant): ActQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
        (fused_activation_quant_proxy): FusedActivationQuantProxy(
          (activation_impl): Identity()
          (tensor_quant): ClampedBinaryQuant(
            (scaling_impl): ConstScaling(
              (restrict_clamp_scaling): _RestrictClampValue(
                (clamp_min_ste): Identity()
                (restrict_value_impl): FloatRestrictValue()
              )
              (value): StatelessBuffer()
            )
            (bit_width): BitWidthConst(
              (bit_width): StatelessBuffer()
            )
            (zero_point): StatelessBuffer()
            (delay_wrapper): DelayWrapper(
              (delay_impl): _NoDelay()
            )
            (tensor_clamp_impl): TensorClamp()
          )
        )
      )
    )
    (9): Dropout(p=0.2, inplace=False)
    (10): QuantLinear(
      in_features=64, out_features=64, bias=False
      (input_quant): ActQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
      )
      (output_quant): ActQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
      )
      (weight_quant): WeightQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
        (tensor_quant): BinaryQuant(
          (scaling_impl): ConstScaling(
            (restrict_clamp_scaling): _RestrictClampValue(
              (clamp_min_ste): Identity()
              (restrict_value_impl): FloatRestrictValue()
            )
            (value): StatelessBuffer()
          )
          (bit_width): BitWidthConst(
            (bit_width): StatelessBuffer()
          )
          (zero_point): StatelessBuffer()
          (delay_wrapper): DelayWrapper(
            (delay_impl): _NoDelay()
          )
        )
      )
      (bias_quant): BiasQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
      )
    )
    (11): BatchNorm1d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (12): QuantIdentity(
      (input_quant): ActQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
      )
      (act_quant): ActQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
        (fused_activation_quant_proxy): FusedActivationQuantProxy(
          (activation_impl): Identity()
          (tensor_quant): ClampedBinaryQuant(
            (scaling_impl): ConstScaling(
              (restrict_clamp_scaling): _RestrictClampValue(
                (clamp_min_ste): Identity()
                (restrict_value_impl): FloatRestrictValue()
              )
              (value): StatelessBuffer()
            )
            (bit_width): BitWidthConst(
              (bit_width): StatelessBuffer()
            )
            (zero_point): StatelessBuffer()
            (delay_wrapper): DelayWrapper(
              (delay_impl): _NoDelay()
            )
            (tensor_clamp_impl): TensorClamp()
          )
        )
      )
    )
    (13): Dropout(p=0.2, inplace=False)
    (14): QuantLinear(
      in_features=64, out_features=10, bias=False
      (input_quant): ActQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
      )
      (output_quant): ActQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
      )
      (weight_quant): WeightQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
        (tensor_quant): BinaryQuant(
          (scaling_impl): ConstScaling(
            (restrict_clamp_scaling): _RestrictClampValue(
              (clamp_min_ste): Identity()
              (restrict_value_impl): FloatRestrictValue()
            )
            (value): StatelessBuffer()
          )
          (bit_width): BitWidthConst(
            (bit_width): StatelessBuffer()
          )
          (zero_point): StatelessBuffer()
          (delay_wrapper): DelayWrapper(
            (delay_impl): _NoDelay()
          )
        )
      )
      (bias_quant): BiasQuantProxyFromInjector(
        (_zero_hw_sentinel): StatelessBuffer()
      )
    )
    (15): TensorNorm()
  )
)
