ir_version: 7
producer_name: "fuse_model"
graph {
  node {
    input: "global_in"
    input: "Div_0_param0"
    output: "Div_0_out0"
    name: "Div_0"
    op_type: "Div"
  }
  node {
    input: "Div_0_out0"
    input: "Reshape_0_param0"
    output: "Reshape_0_out0"
    name: "Reshape_0"
    op_type: "Reshape"
  }
  node {
    input: "Reshape_0_out0"
    input: "Mul_0_param0"
    output: "Mul_0_out0"
    name: "Mul_0"
    op_type: "Mul"
  }
  node {
    input: "Mul_0_out0"
    input: "Sub_0_param0"
    output: "Sub_0_out0"
    name: "Sub_0"
    op_type: "Sub"
  }
  node {
    input: "Sub_0_out0"
    input: "MultiThreshold_0_param0"
    output: "MultiThreshold_0_out0"
    name: "MultiThreshold_0"
    op_type: "MultiThreshold"
    attribute {
      name: "out_bias"
      f: -1.0
      type: FLOAT
    }
    attribute {
      name: "out_dtype"
      s: "BIPOLAR"
      type: STRING
    }
    attribute {
      name: "out_scale"
      f: 2.0
      type: FLOAT
    }
    domain: "finn.custom_op.general"
  }
  node {
    input: "MultiThreshold_0_out0"
    input: "MatMul_0_param0"
    output: "MatMul_0_out0"
    name: "MatMul_0"
    op_type: "MatMul"
  }
  node {
    input: "MatMul_0_out0"
    input: "Mul_1_param0"
    output: "Mul_1_out0"
    name: "Mul_1"
    op_type: "Mul"
  }
  node {
    input: "Mul_1_out0"
    output: "Unsqueeze_0_out0"
    name: "Unsqueeze_0"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "Unsqueeze_0_out0"
    input: "BatchNormalization_0_param0"
    input: "BatchNormalization_0_param1"
    input: "BatchNormalization_0_param2"
    input: "BatchNormalization_0_param3"
    output: "BatchNormalization_0_out0"
    name: "BatchNormalization_0"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "BatchNormalization_0_out0"
    output: "Squeeze_0_out0"
    name: "Squeeze_0"
    op_type: "Squeeze"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "Squeeze_0_out0"
    input: "MultiThreshold_1_param0"
    output: "MultiThreshold_1_out0"
    name: "MultiThreshold_1"
    op_type: "MultiThreshold"
    attribute {
      name: "out_bias"
      f: -1.0
      type: FLOAT
    }
    attribute {
      name: "out_dtype"
      s: "BIPOLAR"
      type: STRING
    }
    attribute {
      name: "out_scale"
      f: 2.0
      type: FLOAT
    }
    domain: "finn.custom_op.general"
  }
  node {
    input: "MultiThreshold_1_out0"
    input: "MatMul_1_param0"
    output: "MatMul_1_out0"
    name: "MatMul_1"
    op_type: "MatMul"
  }
  node {
    input: "MatMul_1_out0"
    input: "Mul_2_param0"
    output: "Mul_2_out0"
    name: "Mul_2"
    op_type: "Mul"
  }
  node {
    input: "Mul_2_out0"
    output: "Unsqueeze_1_out0"
    name: "Unsqueeze_1"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "Unsqueeze_1_out0"
    input: "BatchNormalization_1_param0"
    input: "BatchNormalization_1_param1"
    input: "BatchNormalization_1_param2"
    input: "BatchNormalization_1_param3"
    output: "BatchNormalization_1_out0"
    name: "BatchNormalization_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "BatchNormalization_1_out0"
    output: "Squeeze_1_out0"
    name: "Squeeze_1"
    op_type: "Squeeze"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "Squeeze_1_out0"
    input: "MultiThreshold_2_param0"
    output: "MultiThreshold_2_out0"
    name: "MultiThreshold_2"
    op_type: "MultiThreshold"
    attribute {
      name: "out_bias"
      f: -1.0
      type: FLOAT
    }
    attribute {
      name: "out_dtype"
      s: "BIPOLAR"
      type: STRING
    }
    attribute {
      name: "out_scale"
      f: 2.0
      type: FLOAT
    }
    domain: "finn.custom_op.general"
  }
  node {
    input: "MultiThreshold_2_out0"
    input: "MatMul_2_param0"
    output: "MatMul_2_out0"
    name: "MatMul_2"
    op_type: "MatMul"
  }
  node {
    input: "MatMul_2_out0"
    input: "Mul_3_param0"
    output: "Mul_3_out0"
    name: "Mul_3"
    op_type: "Mul"
  }
  node {
    input: "Mul_3_out0"
    output: "Unsqueeze_2_out0"
    name: "Unsqueeze_2"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "Unsqueeze_2_out0"
    input: "BatchNormalization_2_param0"
    input: "BatchNormalization_2_param1"
    input: "BatchNormalization_2_param2"
    input: "BatchNormalization_2_param3"
    output: "BatchNormalization_2_out0"
    name: "BatchNormalization_2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "BatchNormalization_2_out0"
    output: "Squeeze_2_out0"
    name: "Squeeze_2"
    op_type: "Squeeze"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "Squeeze_2_out0"
    input: "MultiThreshold_3_param0"
    output: "MultiThreshold_3_out0"
    name: "MultiThreshold_3"
    op_type: "MultiThreshold"
    attribute {
      name: "out_bias"
      f: -1.0
      type: FLOAT
    }
    attribute {
      name: "out_dtype"
      s: "BIPOLAR"
      type: STRING
    }
    attribute {
      name: "out_scale"
      f: 2.0
      type: FLOAT
    }
    domain: "finn.custom_op.general"
  }
  node {
    input: "MultiThreshold_3_out0"
    input: "MatMul_3_param0"
    output: "MatMul_3_out0"
    name: "MatMul_3"
    op_type: "MatMul"
  }
  node {
    input: "MatMul_3_out0"
    input: "Mul_4_param0"
    output: "Mul_4_out0"
    name: "Mul_4"
    op_type: "Mul"
  }
  node {
    input: "Mul_4_out0"
    input: "Sub_1_param0"
    output: "Sub_1_out0"
    name: "Sub_1"
    op_type: "Sub"
  }
  node {
    input: "Sub_1_out0"
    input: "Div_1_param0"
    output: "Div_1_out0"
    name: "Div_1"
    op_type: "Div"
  }
  node {
    input: "Div_1_out0"
    input: "Mul_5_param0"
    output: "Mul_5_out0"
    name: "Mul_5"
    op_type: "Mul"
  }
  node {
    input: "Mul_5_out0"
    input: "Add_0_param0"
    output: "Add_0_out0"
    name: "Add_0"
    op_type: "Add"
  }
  node {
    input: "Add_0_out0"
    input: "TopK_0_param0"
    output: "TopK_0_out0"
    output: "global_out"
    name: "TopK_0"
    op_type: "TopK"
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    attribute {
      name: "largest"
      i: 1
      type: INT
    }
    attribute {
      name: "sorted"
      i: 1
      type: INT
    }
  }
  name: "fuse-graph"
  initializer {
    data_type: 1
    name: "Div_0_param0"
    raw_data: "\000\000\177C"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "BatchNormalization_2_param1"
    raw_data: "\303 \025=Z\367\033\276\307\036M\275#\261;\273\375=%\275\352\201H>\341\336l=\313\365#\266x/u\275\376\245V\2732ap\274\354\304^<\264\320@\275\341\256\030>\227\205\322>\307i\010\276\367\241\017\266\000\271\003\277\305\013\327\275\271\201\363\273Q\201\241\275\215|\317=|\246\337\276\tQ\225\2756\210N\274G\343\013\276\347q\343=u:\255<\247zO\265!+\313\275\343\340G=\233\331?<\304\352\241=\262yh=\270^\272<3\335\262\263\313\267\000>\346\021\003?\322^\313>u\263\346\276|\345\240\274\216\320\2374\016\234\271\264\256\344P\274\237\0031\274^\275Z<m\005.\276\340J\236=\313\365\260;\3106\263\274\014i\t>\255\232\032<\235)\215<\241\003\352\264\234^\222\275;(\3615X\345#\276G\350\233>\021\330j\276\1775\354=<b\330>\266\303\216\274K$\226=\212\227k\275"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "BatchNormalization_2_param2"
    raw_data: "]&\201\277(\261\315\277\225\236\n\300S\224\\\300\315\333\251?\243\215\237@l\237\204@)\216\265\300\233+e\300\277\337\027\300\252i\033\300\307\275\240@J\254,@\243\356\n\300\323\255\314@P\022\343\277\271\235\247\300\356\365\206\277N\353:\276\353\324\375?Z\230\212\300\345\303R@\354W$\300\310\375\306\277\366T\034@\342a\251\276\360F\260@\304\306\006@\010~\236@\226A\037?3\201\312@\252\232-@t\215\351?\247\257\300?u\253\302\276\217l\257\300\216U\007? \232y@\221\265!?\237\266m\2778A1\300D\306i\300\200\017\243?\353\370\235\300\272Y\204\277G\277\321?\204\222\351?\300m\177@E\t\202\300\267\270\357\277\335!\257@[S\252@q\\T?TQ\313@G\222\232\300\032\327\301@\035\210:\300\367T^@\202\367\324>)A\310@\375D\301@e6O\300\035\347\332\276U\222\231?"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "BatchNormalization_2_param3"
    raw_data: "5M\nCx\013mC&\330+CdA\026C>\365\211C\363\224QC\345\266_C\377\375\204C8\2602Cy\274JCw\263CC\33393C\236\347\021C\250NaC\365\352\003C#%RCW\240\203C4\322|C\216\356WCa|=C\002F\022C\227\230OC\204t8C\231\244,C(p~CE\241\031C\207\331-C1`jC\016+gC\325\333kCk#\212C\372\332{C\307\177*C\026\200]C\177\037;Cp\027\210CkfTC\346\021\214C\013\232jC\203#\227C#qwC\306\244|C\277\324`C\264U9C\277\035NC\340\251\203C\346b5C\233\267UC\351\337:C)XFC_\307ZCA&uC\002g<C\003\201\213CG\2662C\224\254TC\030\222\221C\345\302DCl\'.C\213\252MCE\243PC\277JTCBeTC-\327YC"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "BatchNormalization_2_param0"
    raw_data: "\301\242\032?8w\347?\2203\253?8_\247?\357^\364?+$\327?S\035\326?\331\225L5\2468\247?\310\250\232?\265E\243?\204R\257?\317\'M?C\314\322?\323\245\300?@\317\233?\003\266\237\265\332\252\354?\313\260\320?\202f\334?Kf\222?\356\207\277?\360k\274?\217Q\251?\033\312\335?Hp\261?\tu\266?=g\324?Am\0066V\r\314?);\025@$&\377?<\036\263?\347\227\303?\033v\232?\304\310p\265\024\215\307?\300\306\373?\210{\336?`\206\016@\001O\365?r\332\234\264\354\223O\265\306\273\323?u\365\313? \273\373?~\212\320?\001\030\323?\020O\266?\326O\263?`]\325?y\266\321?p\027\314?\310\311I\266NS\253?\271\234 6\257m\022@P\261\263?\354\004\252?\313P\327?7\305\316?vd\314?\036\367\336?\202H\317\277"
  }
  initializer {
    dims: 1
    data_type: 1
    name: "Add_0_param0"
    raw_data: "\200c\222\277"
  }
  initializer {
    dims: 1
    data_type: 1
    name: "Sub_1_param0"
    raw_data: "\213\321\345>"
  }
  initializer {
    dims: 1
    data_type: 1
    name: "Mul_5_param0"
    raw_data: "*\357;?"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "BatchNormalization_0_param1"
    raw_data: "=E\334?\200[\025>\315R)>\233\310\307>;\026\340>\035\277\213\276{X\255\275\371\213\'\277\333c\320>N\247\222\272^PQ\300\300\260\237?\260\203\212\277\260\003\342\276\321\361\224\275\022n\210?:a\005?\212\207\n\277\343\371\014\300\203\277z?\335\256\251?\007\234\271\277\2762\227?\233h\211\277\271\001\247\276\231\025\300\277\236Q\361>\345\0257=\366\353\235>{\022\253?\225\257\302\277\335s\t?\231\261\204?4\276\024?\007C:?3\337\206>\204\036\254\276x\317,\277\265&\243\276\351o\244\276\322q\346\275ZN\235\277\253^\241\277\002\010\271\277\024\253 \277\357d\370\275&0\353\277v\245M?\232&\253\277\356_\264?y\254\325>\2506\'?\307\337\377>V\007\206?\212Kr?\321\340l?k\021\377>\206\245\363\274\000\224F\277Q\225\203\277\275\3061?jv\206>S\335\226?\017\245r?"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "BatchNormalization_0_param2"
    raw_data: "1\027\273\301\025Kz\302\203\307\244\301\315g\305@h\275\333A\347U2BC\202\352\301\217\301\243\301\235\222\246\300\"A&\302g\023\307BW\344\222\3027\350\272B\257\235C@,\350v\301\326\367!\300KY\344\301\016\334nA;\276+B\222u\257@\032Y\013\303\030\212\023\302[%\334\301: PB[\252\222\300\351\017VBrN\230\302\007\001}\301\r\216L\302\203\247TB\360\307\201B\005\244\327\301\242\260\360\301\333:\217\301\230\245\215A\220\200\006B\370|\347\301,\350\014C\361\233SB*\014gBX\232)B\020\0357\302\305\306\226\301w\224mA-Hy\301\311\256C\302\272b\374?xXN\300\362\366\305B\357@\212\302fs\246\300I\220\317\277\336\2265\302\374\220l\300}\005\314\302c\332&\301\001\354\005\303\243\006\207By+\352B\002d\'\302\202\230\200\302\35408\302?o\226\301\314\370\331>"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "BatchNormalization_0_param3"
    raw_data: "S\224\343D\343E\204D\240T\332DyA\356D\303\346\241D\237R\275DA\273\253D\3534\301D\241F\337DV\244\232D\205\216\027E\007\"\006E1\212*E\212\371\236D\024\205\364D^<\337D\311\345\250D\367\324\314D\360\262\363DL\354\341D\262\3769E\310j\264DP+\235D.\223\007E$\364\363D\230\230\'E\311Y\005E\036\257\241D\246\324\252D\234\223\260Dt\007\334D\003\331\264DT#\312D\375\327\367Dn\250\367D0Y\372D\336\003\302D$G\025E\017S\254D\337_\351D\365d\223D\033N\304D\352\326\003E`\267\274D\251\243\235D\220\327\356D\252\231\314D\2225\'E\365\"(E\272#\003E$\302\026E\266\312\326D\236\256\265DCD\270D\251\333.E\0225\037Ea\232\"E\247\252\224D\020\'\010E\305\013\352D\"?\017E]\204\357DX_\356D^r\372D"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "BatchNormalization_0_param0"
    raw_data: "\2070\004@E$O?\377\357\240?\231@\257?\363B\211?\026\'\241?\315^\213?\274]\307?L\013\357?dw\215?\207fG@\336R\004@L\354\000@\276\007s?\272H\345?\242$\344?\230\n\242?\020\212\313?z]%@b\246\333?xC\013@M\222\345?\023\230\305?m?\346?6\034\350?\2305\026@Yj\317?m\334\221?_Z\222?\244W\316?\233|\356?H\361\246?$\036\313?\374\216\312?\247:\325?\2744\324?Ls\265?\333[\332?Lt\205?\322\373\277?[\306-?\031\215\317?\373\371\014@w\247\370?\373I\225?\332\310\330\277\215,\005@\202n\030@\361\276\t@\372C\001@3N\325?q\352\272?}\321\241?\002\017\274?\020\201!@\230!\016@\373s\374?`\350B?#\337\362?A\316\362?\354\223\326?\304\346\266?\216n\370?Tw\323?"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "BatchNormalization_1_param1"
    raw_data: "\320\006\223\277w}\010\276\224\256\276>H\345Z\277\304\n\003\300\371\253\252\273pN^\275\300\024\233\277\221b\324?\006\201\216\276s\t\302?\227\327-\277\r\224f\276\210\013\215>#\253@>0\210l\277ur\315\2758\032,?\355\220B?[\253[>\302\004\230\276\216\006N\277WVf@\217\232\024<\311N\206\277\017\302\270?\235\t\223?\3575\273>\230\313O?4\240\r?8\211\025?\324^\315\277\003\031\374\277+\177\343>\205w\240>\022\035\302=^<\242>N\330\310\277\215\201\325<\215\013\005?\r\2066?\320\004d\276\216>\005@\310\315\226\277\343\263I?\230k#?\346\372G?\005\231;>\371\271\304\276\362\304\254?\213o\252\277q\0204=-\272\017@2\341\253\274\330\321\000=\205\016@?\221\217$\277\235\254\350\275\353#\352>\004}/\300\371\256\n?\202F\270\276\275\0278\277\022\231\263\276"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "BatchNormalization_1_param2"
    raw_data: "\007\277\n\277\346\323!@\323g\017@\021\376\240\300\"2\305?b$\304\300\221\t\322>\367\"\240\300\003\366\'\300\363\353\n\301\330\271\311?\302@B\277\267\235\\\300\322\267\006A\356\010f@\373\354\017@Z\256\217@\366\266\004\277\204S\230@\253r\215@\357#\251\300\027\351i?\361\336\337\300\325\204\347\300\001+\177\276\t\337\245=\346\267\275?nN\n\277D>\001@\232<{@E\007c@\3368Z\277>\260\037@&Ij\277\3662\200\300\343.\031@\310\266\265\300\317\311h@B\324\213\300\220B\252@\313\216\375>\204\274\001\301\214Z^\276A\201\274@\257\210z\300\224\3553@>\335\334\276\331B\030\300\316@\265@Q\005\004\300\317gy\300\377H\267>K\251b\277\255\203\320\300\311\232\235@\362=\031\276\374\201\024A\355\026\340\300\177U\362\277#\305w@1\227\360@\251\021\271@\207\"#A\026\245_\300"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "BatchNormalization_1_param3"
    raw_data: "[2+C\330\001\006C\0228)C\324\'\004C\0318$CW\371OC\034i\346BQ\257\'C\274z&C}[\362B7\374LC\247\006VC\007\3514C\240\262?C\361\007NCk\026qC\2550\004CF\223BC\000$CC\343\3050C\335?\032C\371Y\200C\306CKCL\335\311BD\026*CJM2CUDACz\205?C\013H#CB\215)C\t\211\336B\2108\354B\302:IC#\016^Cw\316+C\243\2155C\034+\032C\220\366pC |7C\262\016\034C\0320;C\324\243+Ci\200\tC\332\2515C=\322vCP\241RCs\303LC\227\346\020C\365g:C\375\361qC\034\242@C\305\265\346B,\025fC,Y\007C\207kKC]\321?C\230\376\000C\022l\033C\035\331#C\311\324DCR\t2Cq\264]C\351\036!C\013\001=C"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "BatchNormalization_1_param0"
    raw_data: "\rK\333?#o\214?wi\231?dk\212?={\t@K\221\266?e\213+?I\310\335?\034\r\000\300Rp\214?\363I\366?\013\274\260?\260W\220?h3\213\277\301\211\214?\t>\341?\243\237b?cm\271?\263A\310?\340\203\223?\351\020\223?Og\336?\201\0275@\315\345\014\277#\016\254?\351\371\353?\251\275\357?\222\234\274?8\213\223?\217\361\214?\254p\224?\016(\253?[\271\021@\013\340\306?\347\003\257\277\374v\241?\010\237\213?\203\227\372?\014\223\260?\306!\243?\320\300\307?\342\341\233?R\n\342?bw\316?c\205\340?u]\304?\367\360\276?\245#a?\'\341\260?\005\030\350?\030\263\335?\314\226}?\241:\362?\347\236\203?\0319\242?\344#\306?\266\267x?(\310\210?x\355\240?j<\006@\242F\241\277\260\247\301?\343g\256?\016\367\272?"
  }
  initializer {
    data_type: 1
    name: "Mul_0_param0"
    raw_data: "\000\000\000@"
  }
  initializer {
    dims: 1
    data_type: 1
    name: "Sub_0_param0"
    raw_data: "\000\000\200?"
  }
  initializer {
    dims: 1
    dims: 1
    data_type: 1
    name: "MultiThreshold_0_param0"
    raw_data: "\000\000\000\000"
  }
  initializer {
    dims: 784
    dims: 64
    data_type: 1
    name: "MatMul_0_param0"
    raw_data: 