images; (511765, 1024)
labels: (511765,)
Model: "cnn_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
inputs (InputLayer)          [(None, 1024)]            0         
_________________________________________________________________
reshape (Reshape)            (None, 8, 8, 16)          0         
_________________________________________________________________
conv2d (Conv2D)              (None, 8, 8, 64)          25600     
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          36864     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 64)          36864     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 8, 8, 64)          36864     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 8, 8, 64)          36864     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 8, 8, 1)           64        
_________________________________________________________________
flatten (Flatten)            (None, 64)                0         
_________________________________________________________________
dense (Dense)                (None, 256)               16640     
_________________________________________________________________
outputs (Dense)              (None, 1)                 257       
=================================================================
Total params: 190,017
Trainable params: 190,017
Non-trainable params: 0
_________________________________________________________________
